Take captures, delete old ones
